jonathan-shc/UWB/ports/freertos-nrf52833/board/flash_freertos.c
/*
 * Internal flash on NVMC, arbitrated against the radio with MPSL timeslots.
 *
 * Programming this flash stalls the CPU. A word write is tens of microseconds
 * and a page erase is 89.7 ms, which is longer than MPSL will ever hand out in
 * one piece, so an operation issued while the radio is scheduled would overrun
 * a radio event. With the radio down there is nothing to arbitrate and the work
 * is done directly; with it up the work is cut into pieces and each piece runs
 * inside a timeslot.
 *
 * A write fills as much of its slot as it measures room for. An erase uses the
 * controller's partial-erase mode, which lets a page be erased in fixed slices
 * with the CPU free between them: 89.7 ms of erasing in 3 ms pieces, thirty of
 * them, rather than one stall that would drop a BLE connection.
 *
 * Two things differ from Nordic's own Zephyr driver, deliberately. It gives a
 * kernel semaphore from inside the timeslot callback; this port does not,
 * because that callback runs at interrupt priority zero and FreeRTOS forbids
 * its API above configMAX_SYSCALL_INTERRUPT_PRIORITY. The callback here touches
 * only NVMC and a flag, and the calling task polls that flag. Flash operations
 * are rare and already tens of milliseconds, so a one-tick poll costs nothing
 * and removes the question rather than reasoning about it.
 *
 * Writes and erases are confined to a window that excludes the application
 * image. A store with an offset bug can then lose its own data but cannot erase
 * the firmware out from under a door lock.
 */
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <hal/nrf_nvmc.h>
#include <hal/nrf_timer.h>
#include <mpsl_timeslot.h>
#include <nrfx.h>

#include <FreeRTOS.h>
#include <semphr.h>
#include <task.h>

#include <ultrawidelock_freertos_platform.h>
#include <ultrawidelock_freertos_radio.h>
#include <ultrawidelock_freertos_uwb.h>

#define FLASH_TAG "flash"

/* The part's whole program flash. Reads are allowed anywhere inside it. */
#define FLASH_DEVICE_BASE 0x00000000u
#define FLASH_DEVICE_SIZE (512u * 1024u)

/*
 * What may be written or erased. The default is the two pages the key-value
 * store owns; a board that adds a DFU slot widens it deliberately.
 *
 * AND ONE DID, WITHOUT WIDENING IT. The image links a DFU receiver, advertises
 * an update channel, opens a window on SW2 and accepts the connection -- and
 * then could not write one byte, because patch_staging begins at 0x74000 and
 * every write to it was refused here. The only symptom a user gets is the push
 * tool printing "a flash write or erase failed", which reads as a bad part
 * rather than as a window that was never opened for the partition. MEASURED on
 * hardware 2026-08-15: BEGIN accepted, staging erase refused, error 6.
 *
 * The target build now passes the staging base in, from the same linker script
 * that places the partition (board/nrf52833_lock.ld), so the two cannot drift.
 * The default below is what a build with no DFU slot wants, and it is also what
 * the host suite compiles against. ultrawidelock_flash_area_open() checks the
 * partition against this window at start-up so a future mismatch is a boot-time
 * line rather than a failed update months later.
 */
#ifndef ULTRAWIDELOCK_FREERTOS_FLASH_WRITABLE_BASE
#define ULTRAWIDELOCK_FREERTOS_FLASH_WRITABLE_BASE 0x0007e000u
#endif
#ifndef ULTRAWIDELOCK_FREERTOS_FLASH_WRITABLE_LIMIT
#define ULTRAWIDELOCK_FREERTOS_FLASH_WRITABLE_LIMIT 0x00080000u
#endif

/*
 * A page erase takes 89.7 ms on this part, from the SoC's own timing. Partial
 * erase splits that into slices; thirty 3 ms slices cover it with the CPU free
 * in between. Three milliseconds is Nordic's own default and is above the two
 * the controller requires.
 */
#define FLASH_PAGE_ERASE_TOTAL_US 89700u
#define FLASH_PARTIAL_ERASE_MS 3u
#define FLASH_PARTIAL_ERASE_US (FLASH_PARTIAL_ERASE_MS * 1000u)
#define FLASH_PARTIAL_ERASE_SLICES                                                                 \
	((FLASH_PAGE_ERASE_TOTAL_US + FLASH_PARTIAL_ERASE_US - 1u) / FLASH_PARTIAL_ERASE_US)

/* How much of a timeslot a write may use, matching Nordic's own driver. */
#define FLASH_SLOT_WRITE_US 7500u

/*
 * Slack on top of the work itself. The slot has to cover entry, the callback,
 * and the request for the next one, not just the programming.
 */
#define FLASH_SLOT_SLACK_US 1000u

/*
 * How long a whole operation may take before the caller gives up. Generous on
 * purpose: under a busy radio a two-page erase is sixty slices, each waiting
 * its turn, and failing early would report an I/O error for an operation that
 * was merely slow.
 */
#ifndef ULTRAWIDELOCK_FREERTOS_FLASH_TIMEOUT_MS
#define ULTRAWIDELOCK_FREERTOS_FLASH_TIMEOUT_MS 10000u
#endif

/*
 * How long an operation may be HELD BACK while a UWB ranging session is live,
 * before it runs anyway. The timeslots MPSL grants for flash are arbitrated
 * against BLE and 802.15.4 only; the UWB slot schedule is invisible to them,
 * and NVMC work stalls the CPU outright, so a grant can land a 3 ms erase
 * slice or a multi-millisecond write burst inside the ~1,836 us window between
 * a DW3110 frame and its armed response. Every caller here is a settings
 * persist with no deadline of its own, and a walk-up session ends within a few
 * seconds, so waiting for its idle is nearly free. The wait is still bounded,
 * because a phone parked in range keeps a session listening indefinitely and a
 * persist deferred forever is data lost to the next power cut -- for a lock,
 * the worse trade.
 */
#ifndef ULTRAWIDELOCK_FREERTOS_FLASH_DEFER_MS
#define ULTRAWIDELOCK_FREERTOS_FLASH_DEFER_MS 5000u
#endif
#define FLASH_DEFER_POLL_MS 10u

/*
 * Weak so this file keeps linking where the UWB layer does not: the host tests
 * compile it against fakes, and an image without the radio stack never has a
 * session to defer for. uwb/ultrawidelock_freertos_uwb.c provides the real
 * answer.
 */
__attribute__((weak)) bool ultrawidelock_freertos_uwb_ranging_active(void)
{
	return false;
}

/* Hold the operation until the ranging session ends, or the bound expires. */
static void flash_defer_for_ranging(void)
{
	TickType_t deadline;

	if (__get_IPSR() != 0u || xTaskGetSchedulerState() != taskSCHEDULER_RUNNING) {
		return; /* nothing to yield from; run_op() already handles both contexts */
	}
	if (!ultrawidelock_freertos_uwb_ranging_active()) {
		return;
	}
	deadline = xTaskGetTickCount() + pdMS_TO_TICKS(ULTRAWIDELOCK_FREERTOS_FLASH_DEFER_MS);
	while (ultrawidelock_freertos_uwb_ranging_active()) {
		if ((int32_t)(xTaskGetTickCount() - deadline) >= 0) {
			ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_WARNING, FLASH_TAG,
						   "ranging still live after %u ms; flash work proceeds",
						   (unsigned)ULTRAWIDELOCK_FREERTOS_FLASH_DEFER_MS);
			break;
		}
		vTaskDelay(pdMS_TO_TICKS(FLASH_DEFER_POLL_MS));
	}
}

