jonathan-shc/UWB/ports/freertos-nrf52833/board/flash_freertos.c
/*
 * ONE WRITER AT A TIME, and this is not defensive programming.
 *
 * Everything below this line is module state: the operation in flight, the
 * timeslot session id, the request and the done/failed flags. There is also
 * exactly ONE MPSL timeslot session, because mpsl_timeslot_session_count_set()
 * below asks for one -- so a second task entering while the first holds the
 * session does not merely interleave the statics, it gets a hard failure from
 * mpsl_timeslot_session_open().
 *
 * WHICH IS WHAT HAPPENED. Two subsystems persist independently and neither
 * knows about the other: OpenThread writes its SRP key and PSA ITS records from
 * the Thread task, and the Matter handler writes the reader identity from the
 * commissioning path. During commissioning they overlap, and on 2026-08-14 the
 * collision landed exactly on SetAliroReaderConfig:
 *
 *   invoke: endpoint 1 cluster 0x0101 command 0x0028, 144 B fields
 *   E flash: timeslot session open failed
 *   W ultrawidelock_prov: kv set rc=-4
 *   E reader identity NOT stored (-4)
 *
 * and the controller, having provisioned a reader the device then failed to
 * keep, removed the fabric and reported "unable to add accessory". Writes
 * before and after it succeeded, which is what makes an unserialised race look
 * like flaky hardware.
 *
 * A mutex rather than a critical section: an erase can hold this for the whole
 * ULTRAWIDELOCK_FREERTOS_FLASH_TIMEOUT_MS, and blocking the scheduler for that long would
 * take the radio down with it. Priority inheritance comes with FreeRTOS mutexes
 * and is wanted here, since the Thread task outranks the work queue.
 */
static StaticSemaphore_t s_lock_storage;
static SemaphoreHandle_t s_lock;

/*
 * Created on first use inside a critical section rather than from an init hook,
 * because the first flash access happens while settings are loaded during
 * bring-up and adding an ordering requirement between that and a new init call
 * is a worse trade than one uncontended critical section.
 */
static SemaphoreHandle_t flash_lock(void)
{
	if (s_lock == NULL) {
		taskENTER_CRITICAL();
		if (s_lock == NULL) {
			s_lock = xSemaphoreCreateMutexStatic(&s_lock_storage);
		}
		taskEXIT_CRITICAL();
	}
	return s_lock;
}

/*
 * Locking is skipped before the scheduler runs and inside an interrupt. Neither
 * can contend: nothing else is running yet in the first case, and the second is
 * already refused by run_op() whenever the radio is up, which is the only time
 * the session matters.
 *
 * Returns 0 to proceed and -1 to give up. *held says whether a release is owed,
 * and the two are deliberately separate: "no lock was needed" and "the lock
 * could not be had" both mean not-held, and treating them alike would let a
 * timed-out caller walk into the shared state it just failed to reserve.
 */
static int flash_lock_take(bool *held)
{
	SemaphoreHandle_t lock = flash_lock();

	*held = false;
	if (lock == NULL || __get_IPSR() != 0u ||
	    xTaskGetSchedulerState() != taskSCHEDULER_RUNNING) {
		return 0;
	}
	/*
	 * Bounded rather than portMAX_DELAY. A holder always finishes -- it
	 * polls against its own deadline -- so waiting longer than two of those
	 * means something is wrong that waiting will not fix, and a caller that
	 * is told no can report a failed write instead of never returning.
	 */
	if (xSemaphoreTake(lock, pdMS_TO_TICKS(2u * ULTRAWIDELOCK_FREERTOS_FLASH_TIMEOUT_MS)) != pdTRUE) {
		ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_ERROR, FLASH_TAG,
				 "another task has held the flash for %u ms",
				 (unsigned)(2u * ULTRAWIDELOCK_FREERTOS_FLASH_TIMEOUT_MS));
		return -1;
	}
	*held = true;
	return 0;
}

static void flash_lock_give(bool held)
{
	if (held) {
		(void)xSemaphoreGive(s_lock);
	}
}

/* One session's worth of MPSL context, aligned as the API requires. */
static uint32_t s_timeslot_context[(MPSL_TIMESLOT_CONTEXT_SIZE + 3u) / 4u];
static bool s_sessions_configured;

static mpsl_timeslot_session_id_t s_session;
static mpsl_timeslot_request_t s_request;
static mpsl_timeslot_signal_return_param_t s_return;

/*
 * The operation in flight. Written by the calling task before the first
 * request and then only by the timeslot callback, which is why it is volatile:
 * the task polls s_done and reads s_failed without any lock, and the two
 * contexts never run at the same time because the task does nothing but wait.
 */
struct flash_op {
	bool erase;
	uint32_t offset;
	const uint8_t *data;
	size_t remaining;
	unsigned slices;
};

static volatile struct flash_op s_op;
static volatile bool s_done;
static volatile bool s_failed;

/*
 * Bring-up instrumentation, off by default.
 *
 * The timeslot callback runs at interrupt priority zero, where logging is not
 * safe, so it only counts. The task-context wait prints the counts, which is
 * enough to tell "MPSL never granted a slot" from "the slices are running and
 * the operation is merely slow" -- the two failures that look identical from
 * outside, because both leave the caller sitting in the same poll loop.
 */
#ifndef ULTRAWIDELOCK_FREERTOS_FLASH_DIAG
#define ULTRAWIDELOCK_FREERTOS_FLASH_DIAG 0
#endif

#if ULTRAWIDELOCK_FREERTOS_FLASH_DIAG
static volatile uint32_t s_sig_start;
static volatile uint32_t s_sig_idle;
static volatile uint32_t s_sig_retry;
static volatile uint32_t s_sig_other;
#define FLASH_DIAG_COUNT(counter) ((counter)++)
#else
#define FLASH_DIAG_COUNT(counter) ((void)0)
#endif

/*
 * The address a flash offset maps to. On the part they are the same, because
 * program flash is memory-mapped from zero and reads never touch the
 * controller. The host test points this at its model, which is the only way to
 * exercise the read path off target.
 */
#ifndef ULTRAWIDELOCK_FREERTOS_FLASH_MAPPED
#define ULTRAWIDELOCK_FREERTOS_FLASH_MAPPED(offset) ((const void *)(uintptr_t)(offset))
#endif

static bool in_device(uint32_t offset, size_t length)
{
	if (length == 0u) {
		return true;
	}
	/*
	 * Only the upper bound is tested. The device base is zero on this part,
	 * so a lower-bound test on an unsigned offset can never fail, and
	 * writing one anyway is a warning at target-compile time rather than
	 * defence. The static assertion keeps the omission honest: if the base
	 * ever moves, this stops compiling instead of silently accepting
	 * anything below it.
	 */
	_Static_assert(FLASH_DEVICE_BASE == 0u,
		       "a non-zero flash base needs a lower-bound check here");
	if (offset > FLASH_DEVICE_BASE + FLASH_DEVICE_SIZE) {
		return false;
	}
	return length <= (FLASH_DEVICE_BASE + FLASH_DEVICE_SIZE) - offset;
}

static bool in_writable_window(uint32_t offset, size_t length)
{
	if (offset < ULTRAWIDELOCK_FREERTOS_FLASH_WRITABLE_BASE) {
		return false;
	}
	return length <= ULTRAWIDELOCK_FREERTOS_FLASH_WRITABLE_LIMIT - offset;
}

