jonathan-shc/UWB/ports/freertos-nrf52833/board/flash_freertos.c
bool ultrawidelock_freertos_flash_writable(uint32_t offset, size_t length)
{
	return in_writable_window(offset, length);
}

/* Spin until the controller has finished. NVMC stalls the CPU regardless. */
static void wait_ready(void)
{
	while (!nrf_nvmc_ready_check(NRF_NVMC)) {
		/* Spin. */
	}
}

/*
 * Microseconds since this timeslot began. MPSL resets TIMER0 at the start
 * signal and documents it as readable inside the slot, which is how the work
 * knows when to stop without assuming a per-word programming time.
 */
static uint32_t slot_elapsed_us(void)
{
	nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_CAPTURE0);
	return nrf_timer_cc_get(NRF_TIMER0, NRF_TIMER_CC_CHANNEL0);
}

/* Program one word of the pending write. */
static void write_one_word(void)
{
	uint32_t word;

	/*
	 * Assembled rather than dereferenced. The caller is not required to
	 * align its buffer, and casting a byte pointer to uint32_t would break
	 * strict aliasing and rely on the core tolerating an unaligned load;
	 * this core tolerates one for a plain LDR but not for the
	 * multiple-register forms a compiler is free to emit here.
	 */
	memcpy(&word, (const void *)&s_op.data[0], sizeof(word));
	nrf_nvmc_word_write(s_op.offset, word);
	wait_ready();

	s_op.offset += ULTRAWIDELOCK_FREERTOS_FLASH_WRITE_ALIGN;
	s_op.data += ULTRAWIDELOCK_FREERTOS_FLASH_WRITE_ALIGN;
	s_op.remaining -= ULTRAWIDELOCK_FREERTOS_FLASH_WRITE_ALIGN;
}

/* Issue one partial erase slice on the page the operation is standing on. */
static void erase_one_slice(void)
{
	nrf_nvmc_page_partial_erase_start(NRF_NVMC, s_op.offset);
	wait_ready();

	s_op.slices++;
	if (s_op.slices >= FLASH_PARTIAL_ERASE_SLICES) {
		s_op.slices = 0;
		s_op.offset += ULTRAWIDELOCK_FREERTOS_FLASH_PAGE_SIZE;
		s_op.remaining -= ULTRAWIDELOCK_FREERTOS_FLASH_PAGE_SIZE;
	}
}

/*
 * Do as much of the operation as fits, and report whether it is finished.
 *
 * bounded says whether there is a deadline: inside a timeslot there is, and a
 * write stops once another word would not fit. With the radio down there is
 * none and the whole operation runs in one pass.
 */
static bool op_step(bool bounded)
{
	if (s_op.erase) {
		/*
		 * nRF52833 has partial erase but no partial-erase WEN mode: the
		 * MDK defines NVMC_ERASEPAGEPARTIALCFG_DURATION but not
		 * NVMC_CONFIG_WEN_PEen, so the pinned HAL compiles
		 * NRF_NVMC_MODE_PARTIAL_ERASE out of the enum entirely on this
		 * part. The duration register and ERASEPAGEPARTIAL still work;
		 * they are driven from the ordinary erase mode.
		 *
		 * The mode exists on the nRF52840 and the nRF91 series, so the
		 * choice is made by the HAL's own capability symbol rather than
		 * hardcoded, and this file stays correct if it is ever built for
		 * one of those.
		 */
#if NRF_NVMC_HAS_PARTIAL_ERASE_MODE
		nrf_nvmc_mode_set(NRF_NVMC, NRF_NVMC_MODE_PARTIAL_ERASE);
#else
		nrf_nvmc_mode_set(NRF_NVMC, NRF_NVMC_MODE_ERASE);
#endif
		do {
			erase_one_slice();
		} while (s_op.remaining > 0u && !bounded);
	} else {
		nrf_nvmc_mode_set(NRF_NVMC, NRF_NVMC_MODE_WRITE);
		while (s_op.remaining > 0u) {
			write_one_word();
			if (bounded) {
				/*
				 * Stop when another word of the same cost would
				 * not fit. Measuring beats assuming a
				 * programming time this file cannot verify.
				 */
				uint32_t now = slot_elapsed_us();
				uint32_t per_word = now / (s_op.slices + 1u);

				s_op.slices++;
				if (now + per_word >= FLASH_SLOT_WRITE_US) {
					break;
				}
			}
		}
	}

	nrf_nvmc_mode_set(NRF_NVMC, NRF_NVMC_MODE_READONLY);
	wait_ready();
	return s_op.remaining == 0u;
}

/*
 * Runs at interrupt priority zero. It must not call FreeRTOS, must not block
 * beyond the slot it was given, and must return a pointer that outlives it,
 * which is why the return parameter is static.
 */
static mpsl_timeslot_signal_return_param_t *timeslot_callback(mpsl_timeslot_session_id_t session_id,
							      uint32_t signal)
{
	(void)session_id;

	switch (signal) {
	case MPSL_TIMESLOT_SIGNAL_START:
		FLASH_DIAG_COUNT(s_sig_start);
		if (op_step(true)) {
			s_return.callback_action = MPSL_TIMESLOT_SIGNAL_ACTION_END;
		} else {
			s_return.callback_action = MPSL_TIMESLOT_SIGNAL_ACTION_REQUEST;
			s_return.params.request.p_next = &s_request;
		}
		return &s_return;

	case MPSL_TIMESLOT_SIGNAL_SESSION_IDLE:
		/* Every request is done, so the operation is done. */
		FLASH_DIAG_COUNT(s_sig_idle);
		s_done = true;
		return NULL;

	case MPSL_TIMESLOT_SIGNAL_SESSION_CLOSED:
		return NULL;

	case MPSL_TIMESLOT_SIGNAL_BLOCKED:
	case MPSL_TIMESLOT_SIGNAL_CANCELLED:
		/*
		 * The radio took the slot. Ask again rather than failing: the
		 * work is half done and abandoning it here would leave a
		 * partially erased page, which reads as neither old nor new.
		 */
		FLASH_DIAG_COUNT(s_sig_retry);
		if (mpsl_timeslot_request(s_session, &s_request) != 0) {
			s_failed = true;
			s_done = true;
		}
		return NULL;

	default:
		FLASH_DIAG_COUNT(s_sig_other);
		s_failed = true;
		s_done = true;
		return NULL;
	}
}

static int run_under_timeslot(uint32_t slot_us)
{
	TickType_t deadline = xTaskGetTickCount() + pdMS_TO_TICKS(ULTRAWIDELOCK_FREERTOS_FLASH_TIMEOUT_MS);
	int rc = 0;

	if (!s_sessions_configured) {
		if (mpsl_timeslot_session_count_set(s_timeslot_context, 1) != 0) {
			ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_ERROR, FLASH_TAG,
					 "no MPSL timeslot session available");
			return -1;
		}
		s_sessions_configured = true;
	}

	if (mpsl_timeslot_session_open(timeslot_callback, &s_session) != 0) {
		ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_ERROR, FLASH_TAG,
					   "timeslot session open failed");
		return -1;
	}

	s_request.request_type = MPSL_TIMESLOT_REQ_TYPE_EARLIEST;
	s_request.params.earliest.hfclk = MPSL_TIMESLOT_HFCLK_CFG_NO_GUARANTEE;
	s_request.params.earliest.priority = MPSL_TIMESLOT_PRIORITY_NORMAL;
	s_request.params.earliest.length_us = slot_us + FLASH_SLOT_SLACK_US;
	s_request.params.earliest.timeout_us = MPSL_TIMESLOT_EARLIEST_TIMEOUT_MAX_US;

	s_done = false;
	s_failed = false;

#if ULTRAWIDELOCK_FREERTOS_FLASH_DIAG
	s_sig_start = 0;
	s_sig_idle = 0;
	s_sig_retry = 0;
	s_sig_other = 0;
	ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_INFO, FLASH_TAG, "%s %u bytes at 0x%x, slot %u us",
			 s_op.erase ? "erase" : "write", (unsigned)s_op.remaining,
			 (unsigned)s_op.offset, (unsigned)slot_us);
#endif

	if (mpsl_timeslot_request(s_session, &s_request) != 0) {
		mpsl_timeslot_session_close(s_session);
		ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_ERROR, FLASH_TAG,
					   "timeslot request failed");
		return -1;
	}

