jonathan-shc/UWB/ports/freertos-nrf52833/board/flash_freertos.c
	/*
	 * Poll rather than block on a semaphore. The callback that finishes the
	 * operation runs at interrupt priority zero, where FreeRTOS API calls
	 * are not permitted, so it cannot wake anything.
	 */
	while (!s_done) {
		if ((int32_t)(xTaskGetTickCount() - deadline) >= 0) {
			ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_ERROR, FLASH_TAG,
					 "timed out waiting for a timeslot");
			rc = -1;
			break;
		}
		vTaskDelay(1);
	}

#if ULTRAWIDELOCK_FREERTOS_FLASH_DIAG
	ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_INFO, FLASH_TAG,
			 "rc=%d start=%u idle=%u retry=%u other=%u left=%u", rc,
			 (unsigned)s_sig_start, (unsigned)s_sig_idle, (unsigned)s_sig_retry,
			 (unsigned)s_sig_other, (unsigned)s_op.remaining);
#endif

	/* Closing cancels anything still pending. */
	mpsl_timeslot_session_close(s_session);

	if (rc == 0 && s_failed) {
		rc = -1;
	}
	return rc;
}

/* Run the pending operation, arbitrated if the radio is up. */
static int run_op(uint32_t slot_us)
{
	if (!ultrawidelock_freertos_radio_ready()) {
		(void)op_step(false);
		return 0;
	}
	if (__get_IPSR() != 0u) {
		/*
		 * The wait needs a task to yield from, and a flash operation at
		 * interrupt priority would stall the radio anyway.
		 */
		ultrawidelock_freertos_log(ULTRAWIDELOCK_FREERTOS_LOG_ERROR, FLASH_TAG,
				 "refused: flash from an interrupt while the radio is up");
		return -1;
	}
	return run_under_timeslot(slot_us);
}

int ultrawidelock_freertos_flash_read(uint32_t offset, void *buffer, size_t length)
{
	if (buffer == NULL && length != 0u) {
		return -1;
	}
	if (!in_device(offset, length)) {
		return -1;
	}
	/* Flash is memory-mapped for reading; the controller is not involved. */
	memcpy(buffer, ULTRAWIDELOCK_FREERTOS_FLASH_MAPPED(offset), length);
	return 0;
}

int ultrawidelock_freertos_flash_write(uint32_t offset, const void *data, size_t length)
{
	if (data == NULL && length != 0u) {
		return -1;
	}
	if (!in_device(offset, length) || !in_writable_window(offset, length)) {
		return -1;
	}
	if ((offset % ULTRAWIDELOCK_FREERTOS_FLASH_WRITE_ALIGN) != 0u ||
	    (length % ULTRAWIDELOCK_FREERTOS_FLASH_WRITE_ALIGN) != 0u) {
		return -1;
	}
	if (length == 0u) {
		return 0;
	}

	/* Taken BEFORE s_op is touched: the operation record is the shared
	 * state, not just the timeslot session. The ranging defer runs first,
	 * outside the lock, so a held-back writer does not also stall a later
	 * one for the whole defer bound on top of its own. */
	bool held;
	int rc;

	flash_defer_for_ranging();
	if (flash_lock_take(&held) != 0) {
		return -1;
	}
	s_op.erase = false;
	s_op.offset = offset;
	s_op.data = data;
	s_op.remaining = length;
	s_op.slices = 0;
	rc = run_op(FLASH_SLOT_WRITE_US);
	flash_lock_give(held);
	return rc;
}

int ultrawidelock_freertos_flash_erase(uint32_t offset, size_t length)
{
	if (!in_device(offset, length) || !in_writable_window(offset, length)) {
		return -1;
	}
	if ((offset % ULTRAWIDELOCK_FREERTOS_FLASH_PAGE_SIZE) != 0u ||
	    (length % ULTRAWIDELOCK_FREERTOS_FLASH_PAGE_SIZE) != 0u) {
		return -1;
	}
	if (length == 0u) {
		return 0;
	}

	bool held;
	int rc;

	flash_defer_for_ranging();
	if (flash_lock_take(&held) != 0) {
		return -1;
	}
	s_op.erase = true;
	s_op.offset = offset;
	s_op.data = NULL;
	s_op.remaining = length;
	s_op.slices = 0;

	/*
	 * Partial erase needs its slice length programmed once. The controller
	 * keeps it, but setting it per operation costs nothing and means a
	 * board that never calls anything else still gets the right value.
	 */
	nrf_nvmc_partial_erase_duration_set(NRF_NVMC, FLASH_PARTIAL_ERASE_MS);
	rc = run_op(FLASH_PARTIAL_ERASE_US);
	flash_lock_give(held);
	return rc;
}
